---
kind: method
id: M:Autodesk.Revit.DB.Structure.Truss.RemoveProfile
zh: 桁架
source: html/4c7c3d83-3288-ba90-0f6d-b3797422d818.htm
---
# Autodesk.Revit.DB.Structure.Truss.RemoveProfile Method

**中文**: 桁架

Remove the profile of a truss.

## Syntax (C#)
```csharp
public void RemoveProfile()
```